#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-y98SkdMHXjG83Pkt

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=e3vh22gyhl]
module.endpoint_01.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=vo9krzvmif]
module.tennis.aws_s3_bucket.bucket2: Refreshing state... [id=pp-bucket2-us-east-1-531133914787]
module.tennis.aws_s3_bucket.bucket1: Refreshing state... [id=pp-bucket1-us-east-1-531133914787]
module.tennis.aws_s3_bucket.bucket_trail: Refreshing state... [id=pp-buckettrail-us-east-1-531133914787]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=h6gjmy]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=2gtu9o]
module.endpoint_01.aws_api_gateway_resource.resource: Refreshing state... [id=jdhc55]
module.security_demo.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-08263f8zuc-OPTIONS]
module.security_demo.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-08263f8zuc-OPTIONS]
module.endpoint_01.aws_api_gateway_model.model: Refreshing state... [id=qwfsgs]
module.security_demo.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.endpoint_01.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-OPTIONS]
module.security_demo.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.endpoint_01.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-OPTIONS]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=9zgd89]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=e3vh22gyhl-test-*/*]
module.endpoint_01.aws_api_gateway_method.method: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-POST]
module.endpoint_01.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-jdhc55-OPTIONS-200]
module.endpoint_01.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-OPTIONS-200]
module.tennis.aws_s3_bucket_public_access_block.bucket2: Refreshing state... [id=pp-bucket2-us-east-1-531133914787]
module.tennis.aws_s3_bucket_acl.bucket2: Refreshing state... [id=pp-bucket2-us-east-1-531133914787,private]
module.tennis.aws_s3_bucket_public_access_block.bucket_trail: Refreshing state... [id=pp-buckettrail-us-east-1-531133914787]
module.tennis.aws_s3_bucket_acl.bucket_trail: Refreshing state... [id=pp-buckettrail-us-east-1-531133914787,private]
module.tennis.aws_s3_bucket_policy.allow_cloudtrail_access: Refreshing state... [id=pp-buckettrail-us-east-1-531133914787]
module.tennis.aws_cloudtrail.trail: Refreshing state... [id=pp-cloudtrail-us-east-1-531133914787]
module.tennis.aws_iam_role.role: Refreshing state... [id=pp-role-us-east-1-531133914787]
module.tennis.aws_cloudwatch_event_rule.rule: Refreshing state... [id=pp-rule-us-east-1-531133914787]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=3d32b9d4-53a4-431a-b6af-53ae33d291dd]
module.tennis.aws_s3_bucket_acl.bucket1: Refreshing state... [id=pp-bucket1-us-east-1-531133914787,private]
module.tennis.aws_s3_bucket_public_access_block.bucket1: Refreshing state... [id=pp-bucket1-us-east-1-531133914787]
module.endpoint_01.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-POST-200]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=vo9krzvmif]
module.endpoint_01.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.endpoint_01.aws_api_gateway_integration.integration: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-POST]
module.endpoint_01.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.tennis.aws_lambda_function.function: Refreshing state... [id=pp-lambda-us-east-1-531133914787]
module.tennis.aws_cloudwatch_event_target.lambda: Refreshing state... [id=pp-rule-us-east-1-531133914787-pp-lambda-us-east-1-531133914787]
module.tennis.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromEventBridge]
module.tennis.aws_cloudwatch_dashboard.dashboard: Refreshing state... [id=tennis-dashboard]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/3d32b9d4-53a4-431a-b6af-53ae33d291dd,arn:aws:apigateway:us-east-1::/restapis/e3vh22gyhl/stages/test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ansible.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "ansible"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ansible.aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ansible"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-05bd0031419bb91c5",
            ]
          + subnets          = [
              + "subnet-03b71dab2f9a1bb6f",
              + "subnet-072107252df3c7e87",
            ]
        }
    }

  # module.ansible.aws_ecs_task_definition.task will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "ubuntu"
                  + name             = "ansible"
                  + workingDirectory = "/ansible"
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::531133914787:role/ecsTaskExecutionRole"
      + family                   = "ansible"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*